*** Tool

#+name: disk-layout
#+begin_src yaml
- name: test
  encrypt: yes
  filesystem: btrfs
- name: testing
  encrypt: yes
  filesystem: btrfs
#+end_src

#+begin_src sh :stdin disk-layout :results drawer
yq '.[] | .name' -
#+end_src

#+RESULTS:
:results:
test
testing
:end:

#+begin_src elisp
;; define a file extension for YAML
(add-to-list 'org-babel-tangle-lang-exts '("yaml" . "yaml"))

;; built-in default header arguments are fine
(defvar org-babel-default-header-args:yaml '())

(defun org-babel-execute:yaml (body params) body)
#+end_src
